<details ><summary>plan for talos-bootstrap 2025-07-20 21:15:22 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project vaughnw128/immanent-grove#talos-bootstrap has been locked by PR #79
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_nocloud_image["atuan"] will be destroyed
  # (because key ["atuan"] is not in for_each map)
  - resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      - content_type            = "iso" -> null
      - datastore_id            = "local" -> null
      - decompression_algorithm = "zst" -> null
      - file_name               = "talos-nocloud-amd64.img" -> null
      - id                      = "local:iso/talos-nocloud-amd64.img" -> null
      - node_name               = "atuan" -> null
      - overwrite               = false -> null
      - overwrite_unmanaged     = false -> null
      - size                    = 1306525696 -> null
      - upload_timeout          = 600 -> null
      - url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> null
      - verify                  = true -> null
    }

  # proxmox_virtual_environment_download_file.talos_nocloud_image["selidor"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      ~ id                      = "local:iso/talos-nocloud-amd64.img" -> (known after apply)
      ~ size                    = 1306525696 -> (known after apply)
      ~ url                     = "https://factory.talos.dev/image/58e4656b31857557c8bad0585e1b2ee53f7446f4218f3fae486aa26d4f6470d8/v1.9.2/nocloud-amd64.raw.zst" -> "https://factory.talos.dev/image/84f66f3fa52900a0234636ae1da07d5b356cce774673951af35866142158fce6/v1.10.5/nocloud-amd64.raw.zst" # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["controlplane-2"] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "talos_vm" {
      ~ id                      = "104" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.53",
            ],
          - [],
          - [
              - "10.244.4.70",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:feaf:4c4e",
            ],
          - [
              - "fe80::4c90:4eff:fe5c:ce31",
            ],
          - [
              - "fe80::906d:8aff:fe4b:4382",
            ],
          - [
              - "fe80::ac0d:22ff:fe6e:2355",
            ],
          - [
              - "fe80::e8ec:13ff:fe49:5f93",
            ],
          - [
              - "fe80::74c0:22ff:fef2:226e",
            ],
          - [
              - "fe80::a4ee:7cff:feeb:e082",
            ],
          - [
              - "fe80::c406:4cff:fe94:f3a8",
            ],
          - [
              - "fe80::bc83:b3ff:fedb:77c7",
            ],
          - [
              - "fe80::c8c2:ceff:fe37:3029",
            ],
          - [
              - "fe80::1403:4cff:fe91:65e4",
            ],
          - [
              - "fe80::c474:fcff:fe3f:7569",
            ],
          - [
              - "fe80::fc74:9bff:fef3:514b",
            ],
          - [
              - "fe80::80c5:32ff:feff:16a9",
            ],
          - [
              - "fe80::9054:f3ff:fe52:e908",
            ],
          - [
              - "fe80::2480:78ff:fe82:8c6b",
            ],
          - [
              - "fe80::bc0a:a8ff:fe61:724b",
            ],
          - [
              - "fe80::44dd:61ff:fee6:eb1",
            ],
          - [
              - "fe80::9481:cbff:fe96:1ca5",
            ],
          - [
              - "fe80::4c23:56ff:fed4:e5c5",
            ],
          - [
              - "fe80::a4f4:3dff:fe47:6e41",
            ],
          - [
              - "fe80::6cca:a3ff:fe1c:43ef",
            ],
          - [
              - "fe80::a005:c3ff:feca:dfa",
            ],
          - [
              - "fe80::88d4:81ff:fe91:9639",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "B6:B7:08:ED:B0:01",
          - "52:74:06:81:67:10",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:AF:4C:4E",
          - "4E:90:4E:5C:CE:31",
          - "92:6D:8A:4B:43:82",
          - "AE:0D:22:6E:23:55",
          - "EA:EC:13:49:5F:93",
          - "76:C0:22:F2:22:6E",
          - "A6:EE:7C:EB:E0:82",
          - "C6:06:4C:94:F3:A8",
          - "BE:83:B3:DB:77:C7",
          - "CA:C2:CE:37:30:29",
          - "16:03:4C:91:65:E4",
          - "C6:74:FC:3F:75:69",
          - "FE:74:9B:F3:51:4B",
          - "82:C5:32:FF:16:A9",
          - "92:54:F3:52:E9:08",
          - "26:80:78:82:8C:6B",
          - "BE:0A:A8:61:72:4B",
          - "46:DD:61:E6:0E:B1",
          - "96:81:CB:96:1C:A5",
          - "4E:23:56:D4:E5:C5",
          - "A6:F4:3D:47:6E:41",
          - "6E:CA:A3:1C:43:EF",
          - "A2:05:C3:CA:0D:FA",
          - "8A:D4:81:91:96:39",
        ] -> (known after apply)
        name                    = "talos-controlplane-2"
      ~ network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxcc3082b5f2cc9",
          - "lxcf3f6ba04a8fa",
          - "lxca003a5031ae4",
          - "lxc618b1abc49fb",
          - "lxc45e190e9233c",
          - "lxcd40e86cea272",
          - "lxc8b22ff0ee249",
          - "lxc844acab6bc49",
          - "lxc96e1e6873b5c",
          - "lxc9f286bea313e",
          - "lxc8b645b40600d",
          - "lxc3183d62a0722",
          - "lxc629f34672915",
          - "lxc56687de7641e",
          - "lxc0aed5432186e",
          - "lxcaa0a450c1458",
          - "lxc65329aeeae29",
          - "lxcdbd5dc7a5207",
          - "lxc618001ab13e3",
        ] -> (known after apply)
      ~ tags                    = [
          - "talos",
            "terraform",
          + "talos",
        ]
      ~ vm_id                   = 104 -> (known after apply)
        # (25 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ file_id           = "local:iso/talos-nocloud-amd64.img" # forces replacement -> (known after apply) # forces replacement
          ~ path_in_datastore = "vm-104-disk-0" -> (known after apply)
            # (12 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

          ~ ip_config {
              ~ ipv4 {
                  ~ address = "10.0.0.53/24" -> "10.0.0.51/24"
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:AF:4C:4E" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

      ~ vga {
          + acpi                    = (known after apply)
          + bios                    = (known after apply)
          + boot_order              = (known after apply)
          + description             = (known after apply)
          + hook_script_file_id     = (known after apply)
          + id                      = (known after apply)
          + ipv4_addresses          = (known after apply)
          + ipv6_addresses          = (known after apply)
          + keyboard_layout         = (known after apply)
          + kvm_arguments           = (known after apply)
          + mac_addresses           = (known after apply)
          + machine                 = (known after apply)
          + migrate                 = (known after apply)
          + name                    = (known after apply)
          + network_interface_names = (known after apply)
          + node_name               = (known after apply)
          + on_boot                 = (known after apply)
          + pool_id                 = (known after apply)
          + protection              = (known after apply)
          + reboot                  = (known after apply)
          + reboot_after_update     = (known after apply)
          + scsi_hardware           = (known after apply)
          + started                 = (known after apply)
          + stop_on_destroy         = (known after apply)
          + tablet_device           = (known after apply)
          + tags                    = (known after apply)
          + template                = (known after apply)
          + timeout_clone           = (known after apply)
          + timeout_create          = (known after apply)
          + timeout_migrate         = (known after apply)
          + timeout_move_disk       = (known after apply)
          + timeout_reboot          = (known after apply)
          + timeout_shutdown_vm     = (known after apply)
          + timeout_start_vm        = (known after apply)
          + timeout_stop_vm         = (known after apply)
          + vm_id                   = (known after apply)
        } -> (known after apply)

        # (3 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.talos_vm["worker-1"] will be destroyed
  # (because key ["worker-1"] is not in for_each map)
  - resource "proxmox_virtual_environment_vm" "talos_vm" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "101" -> null
      - ipv4_addresses          = [
          - [
              - "127.0.0.1",
              - "169.254.116.108",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.0.51",
            ],
          - [],
          - [
              - "10.244.0.237",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> null
      - ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fe6f:15b6",
            ],
          - [
              - "fe80::88cd:59ff:fea9:b453",
            ],
          - [
              - "fe80::f470:6bff:feca:14d4",
            ],
          - [
              - "fe80::8837:94ff:fecb:5091",
            ],
          - [
              - "fe80::1c71:96ff:fe9c:a039",
            ],
          - [
              - "fe80::a4b4:b8ff:fefb:b9d5",
            ],
          - [
              - "fe80::549c:dbff:feab:bd95",
            ],
          - [
              - "fe80::cc4c:8eff:fe89:4752",
            ],
          - [
              - "fe80::fc10:10ff:fe7c:d6e8",
            ],
          - [
              - "fe80::603b:54ff:fea6:f32a",
            ],
          - [
              - "fe80::2cab:adff:fe87:9d94",
            ],
        ] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "00:00:00:00:00:00",
          - "2A:8C:19:95:5D:E7",
          - "72:F3:BC:10:0B:96",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:6F:15:B6",
          - "8A:CD:59:A9:B4:53",
          - "F6:70:6B:CA:14:D4",
          - "8A:37:94:CB:50:91",
          - "1E:71:96:9C:A0:39",
          - "A6:B4:B8:FB:B9:D5",
          - "56:9C:DB:AB:BD:95",
          - "CE:4C:8E:89:47:52",
          - "FE:10:10:7C:D6:E8",
          - "62:3B:54:A6:F3:2A",
          - "2E:AB:AD:87:9D:94",
        ] -> null
      - migrate                 = false -> null
      - name                    = "talos-worker-1" -> null
      - network_interface_names = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "cilium_vxlan",
          - "lxc_health",
          - "lxc2d79d8038b41",
          - "lxc8f0be68b4902",
          - "lxc4f0a52c298c0",
          - "lxcd2122521c747",
          - "lxc25ef546a4c0c",
          - "lxc2c04760e818c",
        ] -> null
      - node_name               = "atuan" -> null
      - on_boot                 = true -> null
      - protection              = false -> null
      - reboot                  = false -> null
      - reboot_after_update     = true -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - stop_on_destroy         = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "talos",
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 101 -> null
        # (2 unchanged attributes hidden)

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - cpu {
          - cores        = 12 -> null
          - flags        = [] -> null
          - hotplugged   = 0 -> null
          - limit        = 0 -> null
          - numa         = false -> null
          - sockets      = 1 -> null
          - type         = "x86-64-v2-AES" -> null
          - units        = 1024 -> null
            # (2 unchanged attributes hidden)
        }

      - disk {
          - aio               = "io_uring" -> null
          - backup            = true -> null
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - discard           = "ignore" -> null
          - file_format       = "raw" -> null
          - file_id           = "local:iso/talos-nocloud-amd64.img" -> null
          - interface         = "virtio0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-101-disk-0" -> null
          - replicate         = true -> null
          - size              = 100 -> null
          - ssd               = false -> null
            # (1 unchanged attribute hidden)
        }

      - initialization {
          - datastore_id         = "local-lvm" -> null
          - interface            = "ide2" -> null
            # (5 unchanged attributes hidden)

          - ip_config {
              - ipv4 {
                  - address = "10.0.0.51/24" -> null
                  - gateway = "10.0.0.1" -> null
                }
            }
        }

      - memory {
          - dedicated      = 32768 -> null
          - floating       = 0 -> null
          - keep_hugepages = false -> null
          - shared         = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - network_device {
          - bridge       = "vmbr0" -> null
          - disconnected = false -> null
          - enabled      = true -> null
          - firewall     = false -> null
          - mac_address  = "BC:24:11:6F:15:B6" -> null
          - model        = "virtio" -> null
          - mtu          = 0 -> null
          - queues       = 0 -> null
          - rate_limit   = 0 -> null
          - vlan_id      = 0 -> null
            # (1 unchanged attribute hidden)
        }

      - operating_system {
          - type = "l26" -> null
        }
    }

  # talos_machine_configuration_apply.config_apply["controlplane-2"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "config_apply" {
      ~ endpoint                    = "10.0.0.53" -> "10.0.0.51"
        id                          = "machine_configuration_apply"
      ~ node                        = "10.0.0.53" -> "10.0.0.51"
        # (5 unchanged attributes hidden)
    }

  # talos_machine_configuration_apply.config_apply["worker-1"] will be destroyed
  # (because key ["worker-1"] is not in for_each map)
  - resource "talos_machine_configuration_apply" "config_apply" {
      - apply_mode                  = "auto" -> null
      - client_configuration        = {
          - ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBcVd2NXFVRmppOVkxOFhlSEx6RDBjekFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXdNVEk1TURVek16RXpXaGNOTXpVd01USTNNRFV6TXpFeldqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQU5Dc1FqYWNlSEVtZDlhUHh3Ymo2OVQ1TG93K2tUdGl5L2xGCmY2UTdnSG9UbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRk5QdHRMakl2d0crN0krRApoUW5mSHRhSzBQQUdNQVVHQXl0bGNBTkJBR3RqZ3lQZVBnb2xjR1J3cVhwdm11QXFLU3RvYmJ3eStaVDZsSHRCCnJnclU2cDRiWFBPTHdVdmVYZmRVTzdOWk9VQWU5QnNMUHBYMWE0aEc0Y2NlUncwPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> null
          - client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJobS9hdmRoWXd4b2Mrc0h1NmIzaktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5UQXhNamt3TlRNek1UTmFGdzB5TmpBeE1qa3dOVE16TVROYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQWl2ZVNNM3l3ZFhrVWlLQkVBL3ZDYlBSeUJ4U3M2aXVsCjd5UVJEK2hQUlNpalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCVFQ3YlM0eUw4QnZ1eVBnNFVKM3g3V2l0RHdCakFGQmdNclpYQURRUUJYWXRmMApSWlVWYXFQSVplcWJiVnJpT1ZVaXI0Vm5QS3BVVTZNcnJEL0pmMlVKQ0dUOVBJaEpXZ3poNmtUekg0TmdGZUU0CmRFa2RtMis1SCtrVXE1Z0cKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> null
          - client_key         = (sensitive value) -> null
        } -> null
      - config_patches              = [
          - <<-EOT
                "cluster":
                  "allowSchedulingOnControlPlanes": true
                  "discovery":
                    "enabled": true
                  "network":
                    "cni":
                      "name": "none"
                  "proxy":
                    "disabled": true
            EOT,
        ] -> null
      - endpoint                    = "10.0.0.51" -> null
      - id                          = "machine_configuration_apply" -> null
      - machine_configuration       = (sensitive value) -> null
      - machine_configuration_input = (sensitive value) -> null
      - node                        = "10.0.0.51" -> null
    }

Plan: 2 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

</details>